In [1]:
import numpy as np
import pandas as pd

1.	Load the patient dataset and show summary with info().

In [2]:
patient_data = pd.read_csv("Patient_Data.csv")
billing_data = pd.read_csv("Billing_Data.csv")

In [3]:
patient_data

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

In [4]:
patient_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 464.0+ bytes

2.	Select only the columns relevant for billing: ['PatientID', 'Department', 'Doctor', 'BillAmount'].

In [5]:
patient_data[['PatientID', 'Department', 'Doctor', 'BillAmount']]

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

3.	Drop administrative columns like ['ReceptionistID', 'CheckInTime'].

In [6]:
patient_data = patient_data.drop(['ReceptionistID', 'CheckInTime'], axis=1)
patient_data

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

4.	Use groupby to find total bill amount per department.

In [7]:
patient_data.groupby('Department')["BillAmount"].sum()

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

5.	Remove duplicate patient records based on PatientID.

In [8]:
patient_data = patient_data.drop_duplicates('PatientID')
patient_data

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

6.	Fill missing BillAmount values with the mean bill amount.

In [9]:
patient_data = patient_data.fillna(patient_data['BillAmount'].mean())

In [10]:
patient_data

   PatientID     Name   Department     Doctor   BillAmount
0        101    Alice   Cardiology  Dr. Smith  5000.000000
1        102      Bob    Neurology   Dr. John  6233.333333
2        103  Charlie  Orthopedics    Dr. Lee  7500.000000
3        104    David   Cardiology  Dr. Smith  6200.000000
4        105      Eva  Dermatology   Dr. Rose  6233.333333

7.	Merge the billing dataset with patient dataset on PatientID.

In [11]:
merged_data = pd.merge(patient_data, billing_data, on='PatientID')

In [12]:
merged_data

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.000000,2000,3000
1,102,Bob,Neurology,Dr. John,6233.333333,1500,3500
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,2500,5000
3,104,David,Cardiology,Dr. Smith,6200.000000,3000,3200
4,105,Eva,Dermatology,Dr. Rose,6233.333333,1000,4000

8.	Concatenate an additional DataFrame that contains new patients for the current week (row-wise).

In [13]:
new_patients_df = pd.DataFrame({
    'PatientID': [105, 106, 107],
    'Name': ['Meera', 'Kiran', 'Joseph'],
    'Department': ['Cardiology', 'Orthopedics', 'Dermatology'],
    'Doctor' : ['Dr. John', 'Dr. Smith', 'Dr. Lee'],
    'BillAmount': [4500, 3200, 2900]
})

In [14]:
patient_data = pd.concat([patient_data, new_patients_df], axis=0, ignore_index=True)

In [15]:
patient_data

   PatientID     Name   Department     Doctor   BillAmount
0        101    Alice   Cardiology  Dr. Smith  5000.000000
1        102      Bob    Neurology   Dr. John  6233.333333
2        103  Charlie  Orthopedics    Dr. Lee  7500.000000
3        104    David   Cardiology  Dr. Smith  6200.000000
4        105      Eva  Dermatology   Dr. Rose  6233.333333
5        105    Meera   Cardiology   Dr. John  4500.000000
6        106    Kiran  Orthopedics  Dr. Smith  3200.000000
7        107   Joseph  Dermatology    Dr. Lee  2900.000000

9.	Concatenate new billing category columns like ['InsuranceCovered', 'FinalAmount'] (column-wise)

In [16]:
new_billing = pd.DataFrame({
'InsuranceCovered' : [2000,3000,3500,2500,3000,1000,500,0],
'FinalAmount' : [3000,3233.333333,4000,3700,3233.333333,3500,2700,2900]
}
)

In [17]:
patient_data = pd.concat([patient_data,new_billing], axis=1,)

In [18]:
patient_data

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.000000,2000,3000.000000
1,102,Bob,Neurology,Dr. John,6233.333333,3000,3233.333333
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,3500,4000.000000
3,104,David,Cardiology,Dr. Smith,6200.000000,2500,3700.000000
4,105,Eva,Dermatology,Dr. Rose,6233.333333,3000,3233.333333
5,105,Meera,Cardiology,Dr. John,4500.000000,1000,3500.000000
6,106,Kiran,Orthopedics,Dr. Smith,3200.000000,500,2700.000000
7,107,Joseph,Dermatology,Dr. Lee,2900.000000,0,2900.000000